-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Εξυπηρετητής: localhost:3306:3306
-- Χρόνος δημιουργίας: 23 Ιαν 2023 στις 21:33:52
-- Έκδοση διακομιστή: 10.4.18-MariaDB
-- Έκδοση PHP: 8.0.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Βάση δεδομένων: `docwebox`
--

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `appointment`
--

CREATE TABLE `appointment` (
  `id` int(11) NOT NULL,
  `date` date DEFAULT NULL,
  `time` time(6) DEFAULT NULL,
  `doctor_id` int(11) DEFAULT NULL,
  `patient_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `doctor`
--

CREATE TABLE `doctor` (
  `id` int(100) NOT NULL,
  `profession_id` int(100) NOT NULL,
  `appointment_id` int(100) NOT NULL,
  `doctor_name` varchar(60) NOT NULL,
  `password` varchar(60) NOT NULL,
  `city` varchar(60) NOT NULL,
  `address` varchar(100) NOT NULL,
  `tel` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Άδειασμα δεδομένων του πίνακα `doctor`
--

INSERT INTO `doctor` (`id`, `profession_id`, `appointment_id`, `doctor_name`, `password`, `city`, `address`, `tel`) VALUES
(1, 5, 0, 'Φαίδων Παλαιολής', '12345', 'Αθήνα', 'Λεωφόρος Αναγνώστου, 415, 22007', '21 1072 3580'),
(2, 3, 0, 'Απόστολος Τσουκαλάς', '12345', 'Θεσσαλονίκη', 'Λεωφόρος Αναγνώστου, 41-63, 923 18, Νεάπολη-Συκιές', '21 7700 7311'),
(3, 4, 0, 'Γεώργιος Μανιάκης', '12345', 'Αγρίνιο', 'Όδος Κωνσταντινίδου, 073-808, 262 31, Ανώγεια', '21 0418 8264'),
(4, 5, 0, 'Ελευθέριος Καντζιλιέρης', '12345', 'Πάτρα', 'Λεωφόρος Γούσιος, 848, 781 16, Πάτρα', '21 2788 5257'),
(5, 6, 0, 'Σταμάτιος Γιωτόπουλος ', '12345', 'Αθήνα', 'Λεωφόρος Ανυφαντή, 5-2, 482 92, Παρασκευή', '21 0321 3293'),
(6, 7, 0, 'Ιάκωβος Μαυρογένης', '12345', 'Πάτρα', 'Όδος Σακελλαρίου, 443, 253 35, Πάτρα', '21 5855 7463'),
(7, 8, 0, 'Στέργιος Μεταξάς ', '12345', 'Αθήνα', 'Όδος Ρούσσος, 5-3, 219 06, Κερατσίνι-Δραπετσώνα', '21 1072 3458'),
(8, 9, 0, 'Ιορδάνης Μαυρίδης ', '12345', 'Θεσσαλονίκη', 'Λεωφόρος Δελής, 949, 15990, Αμπελόκηποι-Μενεμένη', '21 1080 3560'),
(9, 10, 0, 'Άγγελος Γεννηματάς', '12345', 'Αθήνα', 'Όδος Κολιάτσος, 673, 58275, Γαύδος', '21 7284 3884'),
(10, 11, 0, 'Παρθένα Γούναρη', '12345', 'Αθήνα', 'Λεωφόρος Παπαγεωργίου, 7-1, 50429, Γαύδος', '21 0384 7884'),
(11, 12, 0, 'Ιωάννα Μεταξά ', '12345', 'Θεσσαλονίκη', 'Λεωφόρος Αγγελίδης, 6-3, 770 79, Θεσσαλονίκη', '23 1041 0412'),
(12, 13, 0, 'Παρθένα Κορακάκη ', '12345', 'Αθήνα', 'Όδος Γαλάνη, 159-357, 775 56, Μαρούσι', '21 0421 0235'),
(13, 14, 0, 'Ευστάθιος Ιωάννου', '12345', 'Θεσσαλονίκη', 'Λεωφόρος Παπαδάκης, 37, 50632, Καλαμαριά', '23 1105 4810'),
(14, 15, 0, 'Αργυρός Χρηστόπουλος', '12345', 'Αθήνα', 'Λεωφόρος Νικολαΐδης, 48-52, 349 49, Νέα Σμύρνης', '21 3412 6713'),
(15, 16, 0, 'Παναγιώτα Κονδύλη', '12345', 'Πάτρα', 'Όδος Σκλαβούνος, 2-2, 098 01', '21 3451 5891'),
(16, 17, 0, 'Σταμάτιος Παπαγεωργίου', '12345', 'Θεσσαλονίκη', 'Λεωφόρος Κωστόπουλος, 926, 75894, Νεάπολη', '23 1124 2140'),
(17, 18, 0, 'Ευφροσύνη Δελή', '12345', 'Ρέθυμνο', 'Όδος Κεδίκογλου, 60-10, 25299, Ρέθυμνο', '21 9128 8215'),
(18, 20, 0, 'Στέργιος Καζάκος', '12345', 'Ξάνθη', 'Όδος Κωνσταντίνου, 61-93, 848 14, Ξάνθη', '25 1239 0718'),
(19, 21, 0, 'Βάιος Λαζόπουλος', '12345', 'Χανιά', 'Όδος Θεωδωρίδου, 7-8, 560 78, Πλατανιάς', '24 5123 4891'),
(20, 22, 0, 'Ανδρεάς Γιαλαμάς ', '12345', 'Δράμα', 'Όδος Φωτιάδου, 07, 66771, Δράμα', '21 1204 8019'),
(21, 23, 0, 'Στεριανή Παπανδρέου', '12345', 'Αθήνα', 'Όδος Παπαδοπούλου, 37, 325 34, Μαρούσι', '21 0891 0812'),
(22, 2, 0, 'Ελπίδα Αργυράκη', '12345', 'Αθήνα', 'Λεωφόρος Κολιάτσος, 539-790, 34057, Βουλιαγμένη', '21 0192 0128'),
(23, 3, 0, 'Ανέστης Λιακόπουλος', '12345', 'Καβάλα', 'Λεωφόρος Γεωγιάδου, 471-833, 427 36, Αγία Βαρβάρα', '23 0120 9102'),
(24, 4, 0, 'Ελευθέριος Τσουκαλάς ', '12345', 'Αγρίνιο', 'Όδος Γρηγοριάδης, 8, 834 22, Αγρίνιο', '23 9120 2102'),
(25, 6, 0, 'Ειρήνη Μπενιζέλου', '12345', 'Θεσσαλονίκη', 'Λεωφόρος Σακελλάρης, 053-704, 316 01, Συκιές', '23 1931 0981'),
(26, 7, 0, 'Σωτηρία Γουδή', '12345', 'Αθήνα', 'Όδος Γεωγιάδου, 1, 80816, Ηλιούπολη', '21 0918 2107'),
(27, 8, 0, 'Παύλος Μαραγκός ', '12345', 'Αθήνα', 'Λεωφόρος Παναγιωτίδης, 637, 23234, Σαλαμίνα', '21 9201 9281'),
(28, 9, 0, 'Στυλιανός Μαρής ', '12345', 'Θεσσαλονίκη', 'Όδος Κωνσταντινίδου, 900, 505 69, Αμπελόκηποι', '23 0291 9201'),
(29, 11, 0, 'Γεράσιμος Μαυρίδης', '12345', 'Λακωνία', 'Όδος Ανυφαντή, 9-6, 008 79, Μονεμβασιά', '21 9019 1978'),
(30, 1, 0, 'Χαράλαμπος Παπαδόπουλος', '12345', 'Αθήνα', 'Λεωφόρος Ανδρεάδης, 178-818, 18943, Γαλάτσι', '21 0192 8747'),
(31, 16, 0, 'Αγλαΐα Βασιλειάδη ', '12345', 'Εύβοια', 'Λεωφόρος Θεοτόκου, 9, 258 87, Χαλκίδα', '24 8291 8962'),
(32, 1, 0, 'Ουρανία Παπακωνσταντίνου', '12345', 'Αθήνα', 'Όδος Δημητριάδης, 5, 704 20, Περιστέρι', '21 9129 7471'),
(33, 12, 0, 'Άγγελος Λειβαδίτης ', '12345', 'Ξάνθη', 'Όδος Αγγελόπουλος, 9-3, 662 26, Ξάνθη', '23 9198 7319'),
(34, 1, 0, 'Παρασκευή Αργυράκη ', '12345', 'Δράμα', 'Λεωφόρος Κοντολέων, 0-4, 53430, Δράμα', '23 8919 7812'),
(35, 3, 0, 'Σταυρός Γιαννόπουλος ', '12345', 'Θεσσαλονίκη', 'Όδος Μπόγρη, 384-621, 30367, Καλαμαριά', '23 1294 7461'),
(36, 1, 0, 'Σεραφείμ Γερμανός', '12345', 'Πρέβεζα', 'Λεωφόρος Βαριμπόμπη, 919-169, 06390, Πεύκη', '23 0102 9480'),
(37, 1, 0, 'Αχιλλέας Λαγός', '12345', 'Θεσσαλονίκη', 'Όδος Παπαστεφάνου, 072-134, 58696, Μύκη', '29 9120 3162'),
(38, 17, 0, 'Αδάμ Γιάνναρης', '12345', 'Θεσσαλονίκη', 'Όδος Γεωργίου, 425-660, 659 10, Νέστος', '21 8128 4719'),
(39, 20, 0, 'Ουρανία Μαγγίνα', '12345', 'Αλεξανδρούπολη', 'Όδος Κοσμόπουλος, 789-438, 014 61, Ορεστίαδα', '24 1295 1295'),
(40, 19, 0, 'Νεκτάριος Μητσοτάκης ', '12345', 'Θεσσαλονίκη', 'Όδος Ανδρέου, 989-978, 21200, Θεσσαλονίκη', '23 9128 1124'),
(41, 1, 0, 'Αργυρώ Ανδρέου ', '12345', 'Κέρκυρα', 'Όδος Ευταξίας, 441, 843 06, 21 1072 3580', '29 4919 5123'),
(42, 10, 0, 'Αριστείδης Παπαδάκης', '12345', 'Θεσσαλονίκη', 'Λεωφόρος Ζωγραφός, 328-120, 908 11, Εύοσμος', '23 1299 3123'),
(43, 9, 0, 'Νεκτάρια Βιτάλη', '12345', 'Κοζάνη', 'Λεωφόρος Αντωνιάδης, 741-446, 65252, Τζουμέρκα', '23 8121 9128'),
(44, 22, 0, 'Έλλη Ανδρέου', '12345', 'Έδεσσα', 'Λεωφόρος Κοκκίνου, 35, 812 14, Αλμωπία', '29 0128 4719'),
(45, 20, 0, 'Στυλιανός Λαιμός', '12345', 'Θεσσαλονίκη', 'Όδος Σταματιάδου, 4-0, 56914, Πυλαία-Χορτιάτης', '23 7512 2127'),
(46, 8, 0, 'Θεοχάρης Λύτρας', '12345', 'Ηράκλειο', 'Όδος Αλεξίου, 1, 36356, Άγιοι', '21 7129 6218'),
(47, 1, 0, 'Χριστίνα Γιαννάκη', '12345', 'Άρτα', 'Λεωφόρος Σπανού, 4, 98116, Άρτα', '23 4128 5612'),
(48, 7, 0, 'Αθανάσιος Τσικλητήρας', '12345', 'Κοζάνη', 'Λεωφόρος Σταματιάδου, 2, 194 14, Κοζάνη', '23 9127 6518');

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `patient`
--

CREATE TABLE `patient` (
  `id` int(100) NOT NULL,
  `name` varchar(60) NOT NULL,
  `password` varchar(60) NOT NULL,
  `appointment_id` int(100) NOT NULL,
  `email` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `profession`
--

CREATE TABLE `profession` (
  `id` int(11) NOT NULL,
  `name` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Άδειασμα δεδομένων του πίνακα `profession`
--

INSERT INTO `profession` (`id`, `name`) VALUES
(1, 'Αιματολόγος'),
(2, 'Αλλεργιολόγος'),
(3, 'Αναισθησιολόγος'),
(4, 'Γενικός Ιατρός'),
(5, 'Γαστρεντερολόγος'),
(6, 'Γυναικολόγος'),
(7, 'Δερματολόγος'),
(8, 'Διαιτολόγος'),
(9, 'Καρδιολόγος'),
(10, 'Λογοθεραπευτής'),
(11, 'Μαστολόγος'),
(12, 'Νευρολόγος'),
(13, 'Ογκολόγος'),
(14, 'Οδοντίατρος'),
(15, 'Ορθοπεδικός'),
(16, 'Οφθαλμίατρος'),
(17, 'Παθολόγος'),
(18, 'Παιδίατρος'),
(19, 'Πλαστικός Χειρούργος'),
(20, 'Ρευματολόγος'),
(21, 'Φυσικοθεραπευτής'),
(22, 'Ψυχίατρος'),
(23, 'Ωτορινολαρυγγολόγος');

--
-- Ευρετήρια για άχρηστους πίνακες
--

--
-- Ευρετήρια για πίνακα `appointment`
--
ALTER TABLE `appointment`
  ADD PRIMARY KEY (`id`);

--
-- Ευρετήρια για πίνακα `doctor`
--
ALTER TABLE `doctor`
  ADD PRIMARY KEY (`id`);

--
-- Ευρετήρια για πίνακα `patient`
--
ALTER TABLE `patient`
  ADD PRIMARY KEY (`id`);

--
-- Ευρετήρια για πίνακα `profession`
--
ALTER TABLE `profession`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT για άχρηστους πίνακες
--

--
-- AUTO_INCREMENT για πίνακα `appointment`
--
ALTER TABLE `appointment`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT για πίνακα `doctor`
--
ALTER TABLE `doctor`
  MODIFY `id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT για πίνακα `patient`
--
ALTER TABLE `patient`
  MODIFY `id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT για πίνακα `profession`
--
ALTER TABLE `profession`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
